OdRxIterator.object
\details
Returns the non-typified smart pointer to the object on which the iterator object refers.

OdRxIterator.next
\details
Sets the iterator object to the next element of the container.
\remarks
Returns true if and only if not at the end of the list.

OdRxIterator.done
\details
Returns true if and only if the traversal by this iterator object is completed.